slides/week2/week2.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Week 2</title>
<meta name="author" content="(Evan Bretl)"/>
<link rel="stylesheet" href="https://robojackets.github.io/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="https://robojackets.github.io/reveal.js/css/theme/white.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Week 2</h1>
</section>

<section id="slide-org717985f">
<h2 id="org717985f">What are we doing today?</h2>
<ul>
<li>Introduction to C++
<ul>
<li>Functions</li>
<li>Headers and includes</li>
<li>Namespaces</li>
<li><code>auto</code> keyword</li>
<li>Working with strings</li>

</ul></li>
<li>Using the STSL Robot API
<ul>
<li>Drive in a square</li>
<li>Line following</li>

</ul></li>

</ul>

</section>
<section id="slide-orgdab0975">
<h2 id="orgdab0975">What is C++?</h2>
<ul>
<li>Compiled (fast)</li>
<li>Can be written in many different ways (flexible)</li>
<li>Not merely "C with classes"</li>

</ul>

</section>
<section id="slide-org8397437">
<h2 id="org8397437">Starting notes</h2>
<ul>
<li>We assume some knowledge of basic of C/C++ syntax (if, for, while, etc)
<ul>
<li>If you are lost today, there is another "Week 0" training session which will teach these things</li>

</ul></li>

</ul>

</section>
<section id="slide-org3c8ec3b">
<h2 id="org3c8ec3b">hello-world.cpp</h2>
<ul>
<li>A simple C++ program, we will be explaining what's going on here and more</li>
<li>We will be using cpp.sh for live demos</li>

</ul>
<div class="org-src-container">

<pre  class="src src-C++"><span class="linenr">1: </span><span style="color: #598249;">#include</span> <span style="color: #15968D;">&lt;iostream&gt;</span>
<span class="linenr">2: </span>
<span class="linenr">3: </span><span style="color: #598249;">int</span> <span style="color: #2F7BDE;">main</span>() {
<span class="linenr">4: </span>  <span style="color: #15968D;">std</span>::cout &lt;&lt; <span style="color: #15968D;">"Hello, world!"</span> &lt;&lt; <span style="color: #15968D;">std</span>::endl;
<span class="linenr">5: </span>}
</pre>
</div>
<p>
<a href="http://cpp.sh/9yupt">http://cpp.sh/9yupt</a>
</p>

</section>
<section id="slide-orgc7f2b94">
<h2 id="orgc7f2b94">Compiling and Running</h2>
<ul>
<li>Compiling turns C++ code into an executable program</li>
<li>g++ is a common C++ compiler</li>

</ul>
<pre  class="example">
g++ hello-world.cpp -o hello-world.out
./hello-world.out
</pre>

</section>
<section id="slide-orgba0f7b4">
<h2 id="orgba0f7b4">Functions in C++</h2>
<ul>
<li>Review: A function is a chunk of code with inputs and outputs</li>
<li>C++ functions have 0 or more parameters (inputs) and have 0 or 1 output</li>
<li>Each parameter has a type and there is a return type</li>
<li>The special function <code>main()</code> with return type <code>int</code> gets run automatically</li>
<li>Example
<ul>
<li>Want to add two integers, x and y, and print their result</li>

</ul></li>

</ul>

</section>
<section id="slide-org76dafd9">
<h2 id="org76dafd9">Making a Function</h2>
<ol>
<li>Informative function name</li>
<li>Input types</li>
<li>Return type (<code>void</code> means no return/output)</li>

</ol>
<div class="org-src-container">

<pre  class="src src-C++"><span class="linenr">1: </span><span style="color: #598249;">void</span> <span style="color: #2F7BDE;">addAndPrint</span>(<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>, <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">y</span>) {
<span class="linenr">2: </span>
<span class="linenr">3: </span>}
</pre>
</div>

</section>
<section id="slide-orgfc88db8">
<h2 id="orgfc88db8">Making a Function</h2>
<ul>
<li>Use the parameters to do something</li>

</ul>
<div class="org-src-container">

<pre  class="src src-C++"><span class="linenr">1: </span><span style="color: #598249;">void</span> <span style="color: #2F7BDE;">addAndPrint</span>(<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>, <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">y</span>) {
<span class="linenr">2: </span>    <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">sum</span> = x + y;
<span class="linenr">3: </span>    <span style="color: #15968D;">std</span>::cout &lt;&lt; sum &lt;&lt; <span style="color: #15968D;">std</span>::endl;
<span class="linenr">4: </span>}
</pre>
</div>

</section>
<section id="slide-orgd2590c4">
<h2 id="orgd2590c4">Functions Example</h2>
<ul>
<li>We can split up this code to show you real return types</li>
<li><code>return</code> statement must be used since the return type is not <code>void</code> anymore</li>

</ul>
<div class="org-src-container">

<pre  class="src src-C++"><span class="linenr"> 1: </span><span style="color: #598249;">void</span> <span style="color: #2F7BDE;">addAndPrint</span>(<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>, <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">y</span>) {
<span class="linenr"> 2: </span>    <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">sum</span> = x + y;
<span class="linenr"> 3: </span>    <span style="color: #15968D;">std</span>::cout &lt;&lt; sum &lt;&lt; <span style="color: #15968D;">std</span>::endl;
<span class="linenr"> 4: </span>}
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #598249;">int</span> <span style="color: #2F7BDE;">add</span>(<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>, <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">y</span>) {
<span class="linenr"> 7: </span>    <span style="color: #598249;">return</span> x + y;
<span class="linenr"> 8: </span>}
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #598249;">void</span> <span style="color: #2F7BDE;">print</span>(<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">value</span>) {
<span class="linenr">11: </span>    <span style="color: #15968D;">std</span>::cout &lt;&lt; value &lt;&lt; <span style="color: #15968D;">std</span>::endl;
<span class="linenr">12: </span>}
</pre>
</div>
<ul>
<li><code>print(add(3, 4))</code> gives the same result as <code>addAndPrint(3, 4)</code></li>
<li>Try it yourself <a href="http://cpp.sh/6lvcn">http://cpp.sh/6lvcn</a></li>

</ul>

</section>
<section id="slide-orgfa3a47e">
<h2 id="orgfa3a47e">Forward Declaration</h2>
<ul>
<li>Declaration = defining the name, parameters, and return type
<ul>
<li><code>int foo(int x);</code>  OR</li>
<li><code>int foo(int);</code></li>

</ul></li>
<li>Definition = declaration + filling in the function
<ul>
<li><code>int foo(int x) { return x+1; }</code></li>

</ul></li>
<li>If you forward-declare a function, you must do it higher up in the file than the definition</li>
<li><a href="http://cpp.sh/4mbgg">http://cpp.sh/4mbgg</a></li>

</ul>

</section>
<section id="slide-orgf63900c">
<h2 id="orgf63900c">Overloading</h2>
<ul>
<li>Function signature = name + list of parameter types</li>
<li>Each function must have a unique signature. Names can be the same as long as the  parameters are different</li>

</ul>
<div class="org-src-container">

<pre  class="src src-C++"><span class="linenr">1: </span><span style="color: #5e6263;">// </span><span style="color: #5e6263;">these all have different signatures</span>
<span class="linenr">2: </span><span style="color: #598249;">int</span> <span style="color: #2F7BDE;">add</span>(<span style="color: #598249;">int</span>, <span style="color: #598249;">int</span>);
<span class="linenr">3: </span><span style="color: #598249;">int</span> <span style="color: #2F7BDE;">add</span>(<span style="color: #598249;">int</span>, <span style="color: #598249;">int</span>, <span style="color: #598249;">int</span>);
<span class="linenr">4: </span><span style="color: #598249;">double</span> <span style="color: #2F7BDE;">add</span>(<span style="color: #598249;">double</span>, <span style="color: #598249;">double</span>);
<span class="linenr">5: </span><span style="color: #598249;">double</span> <span style="color: #2F7BDE;">add</span>(<span style="color: #598249;">double</span>, <span style="color: #598249;">double</span>, <span style="color: #598249;">double</span>);
</pre>
</div>

</section>
<section id="slide-orgf488aa0">
<h2 id="orgf488aa0">Includes</h2>
<ul>
<li>Why do we need <code>#include &lt;iostream&gt;</code>?
<ul>
<li>Many things like std::cout don't exist unless you import them</li>
<li><a href="http://cpp.sh/7jb5t">http://cpp.sh/7jb5t</a></li>

</ul></li>
<li>Includes let you bring other code into a file</li>
<li>Use this for
<ul>
<li>Standard library functions and data types (anything std::)</li>
<li>Other installed libraries (e.g. ROS, OpenCV, Qt)</li>
<li>Splitting up a large program into multiple files</li>

</ul></li>
<li>Without including anything, C++ is very limited</li>

</ul>

</section>
<section id="slide-org685392c">
<h2 id="org685392c">Include syntax</h2>
<ul>
<li><code>&lt;&gt;</code> gets code from the standard library or installed libraries</li>
<li><code>""</code> gets code from a nearby folder, or does the same thing as <code>&lt;&gt;</code> if it can't find anything</li>
<li>What's in the <code>&lt;&gt;</code> or <code>""</code> is a file name
<ul>
<li>Traditionally the file name has extension ".h" or ".hpp"</li>

</ul></li>
<li>Examples:</li>

</ul>
<div class="org-src-container">

<pre  class="src src-C++"><span class="linenr">1: </span><span style="color: #598249;">#include</span> <span style="color: #15968D;">&lt;string&gt;</span>  <span style="color: #5e6263;">// </span><span style="color: #5e6263;">standard library</span>
<span class="linenr">2: </span><span style="color: #598249;">#include</span> <span style="color: #15968D;">&lt;QWidget&gt;</span>  <span style="color: #5e6263;">// </span><span style="color: #5e6263;">file installed with Qt</span>
<span class="linenr">3: </span><span style="color: #598249;">#include</span> <span style="color: #15968D;">&lt;ros/ros.h&gt;</span>  <span style="color: #5e6263;">// </span><span style="color: #5e6263;">file installed with ROS</span>
<span class="linenr">4: </span><span style="color: #598249;">#include</span> <span style="color: #15968D;">"include/my_interface.hpp"</span>  <span style="color: #5e6263;">// </span><span style="color: #5e6263;">another file in the same project,</span>
<span class="linenr">5: </span>                                     <span style="color: #5e6263;">// </span><span style="color: #5e6263;">in a folder called "include</span><span style="color: #bd3832; font-weight: bold;">"</span>
</pre>
</div>

</section>
<section id="slide-org269f27d">
<h2 id="org269f27d">Namespaces</h2>
<ul>
<li>What happens when two things are assigned the same name (or the same function signature)?
<ul>
<li><a href="http://cpp.sh/24v43">http://cpp.sh/24v43</a></li>

</ul></li>
<li>Solution: protect your variables and function names with a unique namespace
<ul>
<li><a href="http://cpp.sh/66mrj">http://cpp.sh/66mrj</a></li>
<li>Use keywords from a namespace using the <code>::</code> operator
<ul>
<li>types: <code>std::string</code>, <code>my_library::MyClass</code></li>
<li>functions: <code>std::min_element</code></li>
<li>static variables: <code>std::string::npos</code></li>

</ul></li>

</ul></li>
<li>Best practice: everything you write that is included should be in a namespace</li>

</ul>

</section>
<section id="slide-org0510f6e">
<h2 id="org0510f6e">"using namespace" keyword</h2>
<ul>
<li><a href="http://cpp.sh/4d5gz">http://cpp.sh/4d5gz</a></li>
<li>Handy but also defeats the purpose of namespaces</li>
<li>Use with caution
<ul>
<li>Must be clear, without the namespace, where the function comes from</li>
<li>In general, use only one external namespace in a file (usually std)</li>

</ul></li>

</ul>

</section>
<section id="slide-orge442192">
<h2 id="orge442192">"Auto" Keyword</h2>
<ul>
<li>C++ can figure out for you what type something should be</li>
<li>Function <code>MakeObject()</code> returns some data of a particular type</li>

</ul>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #598249;">namespace</span>::<span style="color: #15968D;">MyVeryLongDataTypeName</span> <span style="color: #2F7BDE;">data</span> = MakeObject();
</pre>
</div>
<p>
OR
</p>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #598249;">auto</span> <span style="color: #2F7BDE;">data</span> = MakeObject();
</pre>
</div>
<p>
This can make your code easier or harder to read/maintain, depending on whether you name your variables well
</p>

</section>
<section id="slide-org3e8bc84">
<h2 id="org3e8bc84">Strings</h2>
<ul>
<li>C string (still valid in C++):</li>

</ul>
<div class="org-src-container">

<pre  class="src src-C++"><span class="linenr">1: </span><span style="color: #598249;">char</span>[] s = <span style="color: #15968D;">"this is a string"</span>;
</pre>
</div>
<ul>
<li>C++ string:</li>

</ul>
<div class="org-src-container">

<pre  class="src src-C++"><span class="linenr">1: </span><span style="color: #598249;">#include</span> <span style="color: #15968D;">&lt;string&gt;</span>
<span class="linenr">2: </span><span style="color: #15968D;">std</span>::<span style="color: #598249;">string</span> <span style="color: #2F7BDE;">s1</span>(<span style="color: #15968D;">"this is a string"</span>);  <span style="color: #5e6263;">// </span><span style="color: #5e6263;">constructor</span>
<span class="linenr">3: </span><span style="color: #15968D;">std</span>::<span style="color: #598249;">string</span> <span style="color: #2F7BDE;">s2</span> = <span style="color: #15968D;">"this is a string"</span>;  <span style="color: #5e6263;">// </span><span style="color: #5e6263;">same effect as constructor</span>
</pre>
</div>
<ul>
<li>Unlike in C, C++ strings are a class instances and have methods</li>

</ul>

</section>
<section id="slide-orge28cbe3">
<h2 id="orge28cbe3">String Methods</h2>
<ul>
<li>What methods can I use for a string? (there are lots)
<ul>
<li>Google! <a href="https://www.google.com/search?q=c+++std::string">https://www.google.com/search?q=c+++std::string</a></li>
<li>cppreference.com is comprehensive and up-to-date</li>

</ul></li>
<li>Adding to end:  + and += operators, <code>append(string)</code>, <code>push_back(char)</code>
<ul>
<li><a href="http://cpp.sh/84u76">http://cpp.sh/84u76</a></li>

</ul></li>
<li>Reading user input:  <code>std::cin &gt;&gt;</code>
<ul>
<li><a href="http://cpp.sh/64mc">http://cpp.sh/64mc</a></li>

</ul></li>
<li>Access characters like an array
<ul>
<li><a href="http://cpp.sh/9gb4x">http://cpp.sh/9gb4x</a></li>

</ul></li>
<li><code>size()</code> and <code>length()</code> each get number of characters</li>

</ul>

</section>
<section id="slide-orgce7dd6e">
<h2 id="orgce7dd6e">Excercise</h2>
<ul>
<li>Find a buddy (or work alone if you want)</li>
<li>Write a function <code>make_palindrome</code>
<ul>
<li>Input: string</li>
<li>Output: string with reversed copy attached</li>
<li><code>make_palindrome("apple")</code> returns <code>"appleelppa"</code></li>

</ul></li>
<li>Starter code: <a href="http://cpp.sh/844tx">http://cpp.sh/844tx</a></li>

</ul>

</section>
<section id="slide-org375fa05">
<h2 id="org375fa05">Solution</h2>
<ul>
<li>Using what we've learned so far
<ul>
<li><a href="http://cpp.sh/92y54">http://cpp.sh/92y54</a></li>

</ul></li>
<li>Using Standard Template Library (next week's topic)
<ul>
<li><a href="http://cpp.sh/7jmjg">http://cpp.sh/7jmjg</a></li>

</ul></li>

</ul>

</section>
<section id="slide-org484aec8">
<h2 id="org484aec8">Our Training Robots</h2>
<ul>
<li>We have robots for you to use!</li>
<li>Your code runs on your laptop, sending commands via wifi to the robot</li>
<li>Sensors
<ul>
<li>2 line</li>
<li>1 color</li>
<li>1 ultrasonic</li>
<li>hand proximity / gesture</li>

</ul></li>

</ul>

</section>
<section id="slide-org7f20b00">
<h2 id="org7f20b00">STSL: RJRobot API</h2>
<div class="org-src-container">

<pre  class="src src-C++"><span class="linenr">1: </span><span style="color: #598249;">RJRobot</span> <span style="color: #2F7BDE;">robot</span>(REAL);  <span style="color: #5e6263;">// </span><span style="color: #5e6263;">Make a new robot. Simulation may come later</span>
<span class="linenr">2: </span>robot.SetMotor(<span style="color: #15968D;">Motor</span>::LEFT, -255);  <span style="color: #5e6263;">//</span><span style="color: #5e6263;">-255 to 255 range on motors</span>
<span class="linenr">3: </span>robot.SetMotor(<span style="color: #15968D;">Motor</span>::RIGHT, 255);
<span class="linenr">4: </span>robot.Wait(1000ms);
<span class="linenr">5: </span>robot.StopMotors();
<span class="linenr">6: </span><span style="color: #598249;">int</span> <span style="color: #2F7BDE;">line_brightness</span> = robot.GetLineValue(<span style="color: #15968D;">LightSensor</span>::CENTER);  <span style="color: #5e6263;">// </span><span style="color: #5e6263;">downwards line sensor</span>
<span class="linenr">7: </span><span style="color: #598249;">double</span> <span style="color: #2F7BDE;">clearance</span> = robot.GetUltrasonicDistance();  <span style="color: #5e6263;">// </span><span style="color: #5e6263;">forwards ultrasonic sensor</span>
<span class="linenr">8: </span><span style="color: #598249;">Color</span> <span style="color: #2F7BDE;">ball_color</span> = robot.GetColor();  <span style="color: #5e6263;">// </span><span style="color: #5e6263;">forwards color sensor. RED, BLUE, or UNKNOWN</span>
</pre>
</div>
<p>
Full details in <a href="https://github.com/RoboJackets/stsl/blob/master/include/STSL/RJRobot.h">STSL/RJRobot.h</a>
</p>

</section>
<section id="slide-orgb524d98">
<h2 id="orgb524d98">Connecting to the Robot</h2>
<ul>
<li>Make sure you have the software-training repo cloned</li>
<li>Open CLion</li>
<li>Open the existing project software-training/hardware<sub>applications</sub></li>
<li>Connect to your robot's wifi network</li>
<li>In the Build Configuration menu in the top-right of CLion, select spin<sub>in</sub><sub>place</sub></li>
<li>Hit the run button</li>

</ul>

</section>
<section id="slide-org33f2697">
<h2 id="org33f2697">Today's coding exercises</h2>
<ul>
<li>Drive in a square
<ul>
<li>modify code in drive<sub>in</sub><sub>square</sub> folder</li>
<li>Use a combination of SetMotor, Wait, and StopMotors to drive in a square</li>
<li>You should use a for loop</li>

</ul></li>
<li>Line Following
<ul>
<li>Basic algorithm: if black, turn forward-left, else turn forward-right</li>
<li>Implement a better way if you want</li>

</ul></li>

</ul>
</section>
</section>
</div>
</div>
<script src="https://robojackets.github.io/reveal.js/lib/js/head.min.js"></script>
<script src="https://robojackets.github.io/reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: false,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,
width: 1440,
height: 800,
margin: 0.15,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'None', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'fast',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://robojackets.github.io/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } },
]
});
</script>
</body>
</html>
